src/Documents/ОплатаЗаказа/ОплатаЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаЗаказа</name>
  <registerRecords>AccumulationRegister.НеоплаченныеЗаказы</registerRecords>
  <attributes>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.Курьеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.Заказ</types>
    </type>
  </attributes>
</mdclass:Document>

src/AccumulationRegisters/НеоплаченныеЗаказы/НеоплаченныеЗаказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НеоплаченныеЗаказы</name>
  <resources>
    <name>КоличествоНеоплаченныхЗаказов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОснованиеПлатежа</name>
    <type>
      <types>DocumentRef.Заказ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Курьеры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ОплатаЗаказа/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//#Область ОписаниеПеременных
//
//#КонецОбласти

//#Область ПрограммныйИнтерфейс
//
//// Код процедур и функций
//
//#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр НеоплаченныеЗаказы
	Движения.НеоплаченныеЗаказы.Записывать = Истина;
	Движение = Движения.НеоплаченныеЗаказы.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.ОснованиеПлатежа = Заказ;
	Движение.Ответственный = Курьер;
	Движение.КоличествоНеоплаченныхЗаказов = 1;
	
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НеоплаченныеЗаказыОстатки.ОснованиеПлатежа КАК ОснованиеПлатежа
		|ИЗ
		|	РегистрНакопления.НеоплаченныеЗаказы.Остатки(, ОснованиеПлатежа = &ОснованиеПлатежа) КАК НеоплаченныеЗаказыОстатки
		|ГДЕ
		|	НеоплаченныеЗаказыОстатки.КоличествоНеоплаченныхЗаказовОстаток < 0";
	Запрос.УстановитьПараметр("ОснованиеПлатежа", Заказ);
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заказ уже оплачен.";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Поле = "Заказ";
		Сообщение.Сообщить();
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//
//// Код процедур и функций
//
//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции
//
//// Код процедур и функций
//
//#КонецОбласти

//#Область Инициализация
//
//#КонецОбласти

#КонецЕсли
